PJ82RU/esp32-bluetooth-arduino/src/bluetooth_callbacks.cpp
#include "bluetooth_callbacks.h"
#include "esp32-hal-log.h"

namespace hardware {
    void BluetoothServerCallbacks::onConnect(BLEServer *pServer) {
        device_connected++;
        log_i("Device connected");
    }

    void BluetoothServerCallbacks::onDisconnect(BLEServer *pServer) {
        device_connected--;
        log_i("Device disconnected");

        if (device_connected == 0 && pServer) {
            // время на подготовку стека bluetooth
            delay(500);
            pServer->startAdvertising();
        }
    }

    void BluetoothCharacteristicCallbacks::onWrite(BLECharacteristic *pCharacteristic) {
        if (!pCharacteristic) {
            log_w("Characteristic not found");
            return;
        }
        if (!buffer) {
            log_w("The clipboard is missing");
            return;
        }

        std::string value = pCharacteristic->getValue();
        buffer->size = value.length();
        if (buffer->size == 0) {
            log_w("Receive data size is outside");
            return;
        }
        if (buffer->size > BLUETOOTH_WRITE_SIZE) {
            buffer->size = BLUETOOTH_WRITE_SIZE;
        }

        memcpy(buffer->frame.bytes, value.c_str(), buffer->size);
        buffer->is_data = true;

        log_d("Receive data: id: %d, size: %zu", buffer->frame.value.id, buffer->size - 1);
    }
}